tap "facebook/fb"
tap "homebrew/bundle"
tap "oven-sh/bun"
tap "sdkman/tap"
# Ruby version manager
brew "rbenv"
# Rust toolchain installer
brew "rustup-init"
# Cross-shell prompt for astronauts
brew "starship"
# JavaScript toolchain manager for reproducible environments
brew "volta"
# Watch files and take action when they change
brew "watchman"
# A Powerful Command Line for automating iOS Simulators
brew "facebook/fb/idb-companion"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Sdkman - The Software Development Kit Manager
brew "sdkman/tap/sdkman-cli"
# App to build and share containerized applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Desktop debugging platform for mobile developers
cask "flipper"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Web browser
cask "google-chrome"
# HTTP and GraphQL Client
cask "insomnia"
# JetBrains tools manager
cask "jetbrains-toolbox"
# App to write, plan, collaborate, and get organized
cask "notion"
# Team communication and collaboration software
cask "slack"
# Rust-based terminal
cask "warp"
